#+BLOG: perspicaz
#+POSTID: 433
#+DATE: [2018-08-15 Wed 01:30]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+PARENT:
#+CATEGORY: Uncategorized
#+TAGS:
#+DESCRIPTION:
#+TITLE: Favoritos #013
#+PERMALINK: favoritos_013

** A First Look
#+BEGIN_SRC perl
  use PDL;
  use PDL::Graphics::Prima::Simple;
  matrix_plot( sin( rvals( 200, 200 ) + 1 ) );
#+END_SRC

#+RESULTS: 
: Prima::Plot=HASH(0x3117378)

#+BEGIN_SRC perl
  use PDL;
  use PDL::Graphics::Prima::Simple;
  matrix_plot( rvals( 200, 200 ) );
#+END_SRC

#+RESULTS: 
: Prima::Plot=HASH(0x4931ba0)

#+BEGIN_SRC perl
  use PDL;
  rvals(5,5)
#+END_SRC

#+RESULTS: 
|                                                          |
| [                                                        |
| [ 2.8284271   2.236068          2   2.236068  2.8284271] |
| [  2.236068  1.4142136          1  1.4142136   2.236068] |
| [         2          1          0          1          2] |
| [  2.236068  1.4142136          1  1.4142136   2.236068] |
| [ 2.8284271   2.236068          2   2.236068  2.8284271] |
| ]                                                        |

#+BEGIN_SRC perl
  use PDL;
  sequence(5,5);
#+END_SRC

#+RESULTS: 
|                  |
| [                |
| [ 0  1  2  3  4] |
| [ 5  6  7  8  9] |
| [10 11 12 13 14] |
| [15 16 17 18 19] |
| [20 21 22 23 24] |
| ]                |
